Revit 2024 API
AppearanceAssetEditScope.Dispose Method
Releases all resources used by the AppearanceAssetEditScope
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace